# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv5 object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/yolov5

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov5n.yaml' will call yolov5.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.33, 1.25, 1024]

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  #- [-1, 1, Conv, [64, 6, 2, 2]] # 0-P1/2
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C3, [128]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C3, [256]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 9, C3, [512]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C3, [1024]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv5 v6.0 head
head:
  #- [-1, 1, Conv, [512, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C3, [512, False]] # 12

  #- [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C3, [256, False]] # 15 (P3/8-small)

  #- [-1, 1, Conv, [128, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C3, [128, False]] # 18 (P2/4-small)

# 第二轮

  - [ 12, 1, Conv, [ 128, 1, 1 ] ] #20250404 改动：添加1*1卷积层降低计算量
  - [-1, 1, nn.Upsample, [None, 4, "nearest"]] # 20 p2/4
  - [[-1, 18], 1, Concat, [1]]
  - [-1, 1, Conv, [256, 3, 2 ] ]
  - [-1, 3, C3, [512, False]] # 23 p3/8

  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C3, [256, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # /4
  - [[2, 18], 1, Concat, [1]]
  #- [ -1, 1, Conv, [ 128, 1, 1 ] ] ##20250414 改动：添加1*1卷积层降低计算量
  - [[-1, 26], 1, Concat, [1]] 
  - [-1, 3, C3, [256, False]] # 29 (P2/4)

# 输出head

  - [[-1, 20], 1, Concat, [1]] 
  - [ -1, 1, Conv, [ 128, 3, 2 ] ]
  - [ -1, 1, Conv, [ 256, 3, 2 ] ]
  - [-1, 3, C3, [512, False]] # 33 p4 /16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # /8
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C3, [256, False]] # 36 p3 /8

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 37 /4
  - [[2, 29], 1, Concat, [1]] #动
  #- [ -1, 1, Conv, [ 128, 1, 1 ] ] ##20250414 改动：添加1*1卷积层降低计算量
  - [[-1, 37], 1, Concat, [1]] #动
  - [-1, 3, C3, [128, False]] # 40 (P2/4-small)

  - [[40, 36, 33], 1, Detect, [nc]] # Detect(P2, P3, P4)
