# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
# 此版本由yolo11-S3进行修改而来，主要修改最后一轮的模型结构,对输出检测头的特征层进行了修改，旨在保持精度的同时降低参数量 增加了p2检测头的通道数
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 13 (p4/16)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P2
  - [-1, 2, C3k2, [128, False]] # 19 (P2/4-small)

# 第二轮

  - [ 12, 1, Conv, [ 64, 1, 1 ] ] #20250404 改动：添加1*1卷积层降低计算量
  - [-1, 1, nn.Upsample, [None, 4, "nearest"]] # 21 p4/4
  - [[-1, 19], 1, Concat, [1]]
  - [-1, 1, Conv, [256, 3, 2 ] ]
  - [-1, 2, C3k2, [512, True]] # 24 p3/8

  - [[-1, 4], 1, Concat, [1]]
  - [ -1, 2, C3k2, [256, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # /4
  - [[2, 19], 1, Concat, [1]]
  - [[-1, 27], 1, Concat, [1]] #动 26-> 27
  - [-1, 2, C3k2, [256, False]] # 30 (P2/4)

# 第三轮

  - [[-1, 21], 1, Concat, [1]] #动 20 ->21
  - [ -1, 1, Conv, [ 128, 3, 2 ] ]
  - [ -1, 1, Conv, [ 256, 3, 2 ] ]
  - [ -1, 2, C3k2, [ 512, False ] ] # 34 p4 /16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # /8
  - [[-1, 4], 1, Concat, [1]]
  - [ -1, 2, C3k2, [ 256, False ] ] # 37 p3 /8

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 38 /4
  - [[2, 30], 1, Concat, [1]] #动
  - [[-1, 38], 1, Concat, [1]] #动
  - [-1, 2, C3k2, [128, False]] # 41 (P2/4-small)

  - [[41, 37, 34], 1, Detect, [nc]] # Detect(P2, P3, P4) 动


  ## 实验日志
  ## #20250404 改动：四倍上采样前添加1*1卷积层降低对12层的计算量  结果效果与使用13层一样 结论：效果与通道数更紧密，而与是否是原特征不是很相关
  ## 1*1卷积层换到上采样后 并且增加上采样的通道数